ProgessBase/Catalogs/СканированныеДокументыДляПередачиВЭлектронномВиде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СканированныеДокументыДляПередачиВЭлектронномВиде</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПредставляемыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыУчастников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольУчастника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицоНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицоИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрЛицоКПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоФамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоОтчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицоИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯвляетсяЮрЛицом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/Enums/ВидыПредставляемыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПредставляемыхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КнигаПокупок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КнигаПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналПолученныхИВыставленныхСчетовФактур</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварноТранспортнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемкиСдачиРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузоваяТаможеннаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавочныйЛистГрузовойТаможеннойДекларации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйЛистКнигиПокупок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйЛистКнигиПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладнаяТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецификацияЦены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеКДоговору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Catalogs/СканированныеДокументыДляПередачиВЭлектронномВиде/Ext/ObjectModule.bsl
Перем ОшибкаЗаполнения Экспорт;

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если КонтекстЭДО <> Неопределено Тогда
		КонтекстЭДО.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если КонтекстЭДО <> Неопределено Тогда
		КонтекстЭДО.ПриЗаписиОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(СообщениеОснование)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если КонтекстЭДО <> Неопределено Тогда
		КонтекстЭДО.ОбработкаЗаполненияОбъекта(ЭтотОбъект, СообщениеОснование);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры 

Процедура ОбработкаПроверкиЗаполнения (Отказ, ПроверяемыеРеквизиты)
	// формируем соответствие для колучения кода вида документа
	КодПоВидуДокумента = ПолучитьСоответствиеКодПоВидуДокумента();
	КодДок = КодПоВидуДокумента[ВидДокумента];
	
	Если КодДок <> "0924" И КодДок <> "1665" И КодДок <> "2181" 
	   И КодДок <> "2330" И КодДок <> "2234" И КодДок <> "2745"
	   И КодДок <> "2766" И КодДок <> "2772" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаДокумента")); 
	КонецЕсли; 
	
	Если КодДок <> "0924" И КодДок <> "1665" И КодДок <> "2215" 
	   И КодДок <> "2216" И КодДок <> "2330" И КодДок <> "2745"
	   И КодДок <> "2766" И КодДок <> "2772" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерДокумента")); 
	КонецЕсли;
	
	//Если КодДок <> "0924" И КодДок <> "1665" И КодДок <> "2181" 
	//   И КодДок <> "2330" И КодДок <> "2234" И КодДок <> "2772" Тогда
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СуммаВсего")); 
	//КонецЕсли;
	//
	//Если КодДок <> "0924" Тогда
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СуммаНалога")); 
	//КонецЕсли;

	Если КодДок <> "1665" И КодДок <> "2181" И КодДок <> "2216" 
	   И КодДок <> "2330" И КодДок <> "2745" И КодДок <> "2772" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерОснования")); 
	КонецЕсли;
	
	Если КодДок <> "1665" И КодДок <> "2181" И КодДок <> "2330" 
	   И КодДок <> "2745" И КодДок <> "2772" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаОснования")); 
	КонецЕсли;
	
	Если КодДок <> "2745" И КодДок <> "2330" И КодДок <> "2766" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПредметДокумента")); 
	КонецЕсли; 
	
	Если КодДок <> "0924" И КодДок <> "1665" И КодДок <> "2181" 
	   И КодДок <> "2330" И КодДок <> "2234" И КодДок <> "2745"
	   И КодДок <> "2766" И КодДок <> "2772" Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("РеквизитыУчастников")); 
	КонецЕсли;

	// Обходим строки и проверяем заполнение реквизита
   Для Индекс = 1 по РеквизитыУчастников.Количество() Цикл
	   Индекс0 = Индекс - 1;
	   РеквизитыУчастника = РеквизитыУчастников.Получить(Индекс0);
	   
	   Если РеквизитыУчастника.ЯвляетсяЮрЛицом Тогда
		   //для юридического лица
		   
		   Если Не ЗначениеЗаполнено(РеквизитыУчастника.ЮрЛицоНаименование) Тогда
			   Сообщение = Новый СообщениеПользователю();
			   Сообщение.Текст = "В строке " + Индекс + " таблицы ""Реквизиты участников сделки"" не заполнено значение ""Полное наименование организации""";
			   Сообщение.Поле = "РеквизитыУчастников[" + Индекс0 + "].ЮрЛицоНаименование";
			   Сообщение.УстановитьДанные(ЭтотОбъект);
			   Сообщение.Сообщить();
			   Отказ = Истина;
		   КонецЕсли;
		   
		   Если КодДок = "2181" ИЛИ КодДок = "2330" ИЛИ КодДок = "2745" ИЛИ КодДок = "2766" Тогда
			   
			   Если Не ЗначениеЗаполнено(РеквизитыУчастника.ЮрЛицоИНН) Тогда
				   Сообщение = Новый СообщениеПользователю();
				   Сообщение.Текст = "В строке " + Индекс + " таблицы ""Реквизиты участников сделки"" не заполнено значение ""ИНН организации""";
				   Сообщение.Поле = "РеквизитыУчастников[" + Индекс0 + "].ЮрЛицоИНН";
				   Сообщение.УстановитьДанные(ЭтотОбъект);
				   Сообщение.Сообщить();
				   Отказ = Истина;
			   КонецЕсли;
			   
		   КонецЕсли;
		   
	   Иначе
		   //для физического лица
		   
		   //отменяем проверку для физ лица - в случае отсутствия ИНН выгружаем 12 нулей
		   // Если КодДок = "2181" ИЛИ КодДок = "2330" ИЛИ КодДок = "2745" ИЛИ КодДок = "2766" Тогда
		   //	
		   //	Если Не ЗначениеЗаполнено(РеквизитыУчастника.ФизЛицоИНН) Тогда
		   // 	   Сообщение = Новый СообщениеПользователю();
		   // 	   Сообщение.Текст = "В строке " + Индекс + " таблицы ""Реквизиты участников сделки"" не заполнено значение ""ИНН физического лица""";
		   // 	   Сообщение.Поле = "РеквизитыУчастников[" + Индекс0 + "].ФизЛицоИНН";
		   // 	   Сообщение.УстановитьДанные(ЭтотОбъект);
		   // 	   Сообщение.Сообщить();
		   // 	   Отказ = Истина;
		   //	КонецЕсли;
		   //	
		   //КонецЕсли;
		   
	   КонецЕсли;
	   
   КонецЦикла;

КонецПроцедуры

//вспомогательная для ОбработкаПроверкиЗаполнения 
Функция ПолучитьСоответствиеКодПоВидуДокумента()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.СчетФактура,								"0924");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.КнигаПокупок, 								"0925");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.КнигаПродаж, 								"0926");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ЖурналПолученныхИВыставленныхСчетовФактур, 	"1004");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ТоварноТранспортнаяНакладная, 				"1665");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.АктПриемкиСдачиРабот, 						"2181");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ГрузоваяТаможеннаяДекларация, 				"2215");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ДобавочныйЛистГрузовойТаможеннойДекларации, "2216");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ДополнительныйЛистКнигиПокупок, 			"2232");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ДополнительныйЛистКнигиПродаж, 				"2233");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ТоварнаяНакладнаяТОРГ12, 					"2234");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.СпецификацияЦены, 							"2330");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.ДополнениеКДоговору, 						"2745");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.Договор, 									"2766");
	Соответствие.Вставить(Перечисления.ВидыПредставляемыхДокументов.КорректировочныйСчетФактура,				"2772");
	
	Возврат Соответствие;
	
КонецФункции
